#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "Russian"); //Ввод кирилиици в функцию

    //Объявление переменных
    int hour;
    double bP, fP;

    cout << "Введите час поездки (0-23): ";          //Вывод фразы
    cin >> hour;                                     //Ввод количества часов
    cout << "Введите базовую стоимость поездки: ";
    cin >> bP;                                       //Ввод базовой стоимости

    // Проверяем условие: ночное время или нет
    if (hour >= 23 || hour < 6) {
        fP = bP * 1.20; //Добавляем 20%
        cout << "Ночной тариф. Итоговая стоимость: " << fP << endl;
    } else {
        fP = bP; //Наценки нет
        cout << "Дневной тариф. Итоговая стоимость: " << fP << endl;
    }

    return 0;
}